## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 10 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                NAME                                                 |
|----------|-----------------------------------------------------------------------------------------------------|
| recreate | `aws_secretsmanager_secret_version.pr_bot_private_key`                                              |
| update   | `aws_cloudwatch_dashboard.errors[0]`                                                                |
|          | `aws_cloudwatch_dashboard.notify_system[0]`                                                         |
|          | `aws_cloudwatch_metric_alarm.service-callback-too-many-failures-warning[0]`                         |
|          | `aws_iam_policy.parameters_csi`                                                                     |
|          | `aws_iam_policy.secrets_csi`                                                                        |
|          | `aws_kinesis_firehose_delivery_stream.firehose-waf-logs`                                            |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                  |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1]` |
|          | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[2]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.errors[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "errors" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ dashboard_body = (sensitive value)
        id             = "Errors"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.notify_system[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "notify_system" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ dashboard_body = (sensitive value)
        id             = "Notify-System-Overview"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.service-callback-too-many-failures-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "service-callback-too-many-failures-warning" {
      ~ alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-critical",
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      ~ alarm_description                     = "Service reached the max number of callback retries 100 times in 10 minutes" -> "Service reached the max number of callback retries 25 times in 5 minutes"
        id                                    = "service-callback-too-many-failures-warning"
      ~ period                                = 600 -> 300
        tags                                  = {}
      ~ threshold                             = 100 -> 25
        # (18 unchanged attributes hidden)
    }

  # aws_iam_policy.parameters_csi will be updated in-place
  ~ resource "aws_iam_policy" "parameters_csi" {
        id               = "arn:aws:iam::239043911459:policy/parameters-csi-policy"
        name             = "parameters-csi-policy"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy           = (sensitive value)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.secrets_csi will be updated in-place
  ~ resource "aws_iam_policy" "secrets_csi" {
        id               = "arn:aws:iam::239043911459:policy/secrets-csi-policy"
        name             = "secrets-csi-policy"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy           = (sensitive value)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose-waf-logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose-waf-logs" {
        id             = "arn:aws:firehose:ca-central-1:239043911459:deliverystream/aws-waf-logs-notification-canada-ca-waf"
        name           = "aws-waf-logs-notification-canada-ca-waf"
        tags           = {
            "CostCenter" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ prefix              = (sensitive value)
            # (10 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_secretsmanager_secret_version.pr_bot_private_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "pr_bot_private_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:PR_BOT_PRIVATE_KEY-EIUsAp" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:PR_BOT_PRIVATE_KEY-EIUsAp|terraform-20240318133723242600000006" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240318133723242600000006" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-cloud-watch-forwarder"
      ~ layers                         = [
          ~ "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:153" -> "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:161",
        ]
        tags                           = {
            "CostCentre" = "notification-canada-ca-staging"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be updated in-place
  ~ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
        id                  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-0"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ source_arn          = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[1] will be updated in-place
  ~ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
        id                  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-1"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ source_arn          = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[2] will be updated in-place
  ~ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
        id                  = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-2"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ source_arn          = (sensitive value)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 10 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acmpca_certificate_authority.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
